---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.DuctLining
source: html/55fc9a41-15ff-84ad-195e-3d0edb776aab.htm
---
# Autodesk.Revit.DB.Mechanical.DuctLining

Represents Lining applied to the inside of a given duct, fitting or accessory.

## Syntax (C#)
```csharp
public class DuctLining : InsulationLiningBase
```